const DATA = [
    {
        question: 'Может назвать полностью свое имя, отчество и фамилию, свой возраст и дату рождения, половую принадлежность',
        answers: [
            {
                id: '0',
                value: '0 баллов – обучающийся не отвечает на поставленный вопрос, даже при помощи педагога',
                correct: 0
            },
            {
                id: '1',
                value: '1 балл – обучающийся правильно отвечает на поставленный вопрос при значительной помощи (нескольких наводящих вопросов) педагога;',
                correct: 1
            },
            {
                id: '2',
                value: '2 балл – обучающийся правильно отвечает на вопрос при незначительной помощи (не более чем одного наводящего вопроса) педагога;',
                correct: 2
            },
            {
                id: '3',
                value: '3 балла – обучающийся сразу правильно без помощи педагога отвечает на поставленный вопрос.',
                correct: 3
            }
        ]
    },
    {
        question: 'Вопрос 2',
        answers: [
            {
                id: '4',
                value: 'Ответ 4',
                correct: false
            },
            {
                id: '5',
                value: 'Ответ 5',
                correct: true
            }
        ]
    }
];